veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxEvadc_bf.h
/**
 * \file IfxEvadc_bf.h
 * \brief
 * \copyright Copyright (c) 2020 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC37xPD_UM_V1.4.0.R0
 * Specification: TC3xx User Manual V1.4.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Evadc_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Evadc_Registers
 * 
 */
#ifndef IFXEVADC_BF_H
#define IFXEVADC_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Evadc_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_EVADC_CLC_Bits.DISR */
#define IFX_EVADC_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_EVADC_CLC_Bits.DISR */
#define IFX_EVADC_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_CLC_Bits.DISR */
#define IFX_EVADC_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_EVADC_CLC_Bits.DISS */
#define IFX_EVADC_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_EVADC_CLC_Bits.DISS */
#define IFX_EVADC_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_CLC_Bits.DISS */
#define IFX_EVADC_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_EVADC_CLC_Bits.EDIS */
#define IFX_EVADC_CLC_EDIS_LEN (1u)

/** \brief Mask for Ifx_EVADC_CLC_Bits.EDIS */
#define IFX_EVADC_CLC_EDIS_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_CLC_Bits.EDIS */
#define IFX_EVADC_CLC_EDIS_OFF (3u)

/** \brief Length for Ifx_EVADC_ID_Bits.MOD_REV */
#define IFX_EVADC_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_EVADC_ID_Bits.MOD_REV */
#define IFX_EVADC_ID_MOD_REV_MSK (0xffu)

/** \brief Offset for Ifx_EVADC_ID_Bits.MOD_REV */
#define IFX_EVADC_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_EVADC_ID_Bits.MOD_TYPE */
#define IFX_EVADC_ID_MOD_TYPE_LEN (8u)

/** \brief Mask for Ifx_EVADC_ID_Bits.MOD_TYPE */
#define IFX_EVADC_ID_MOD_TYPE_MSK (0xffu)

/** \brief Offset for Ifx_EVADC_ID_Bits.MOD_TYPE */
#define IFX_EVADC_ID_MOD_TYPE_OFF (8u)

/** \brief Length for Ifx_EVADC_ID_Bits.MOD_NUMBER */
#define IFX_EVADC_ID_MOD_NUMBER_LEN (16u)

/** \brief Mask for Ifx_EVADC_ID_Bits.MOD_NUMBER */
#define IFX_EVADC_ID_MOD_NUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_EVADC_ID_Bits.MOD_NUMBER */
#define IFX_EVADC_ID_MOD_NUMBER_OFF (16u)

/** \brief Length for Ifx_EVADC_OCS_Bits.TGS */
#define IFX_EVADC_OCS_TGS_LEN (2u)

/** \brief Mask for Ifx_EVADC_OCS_Bits.TGS */
#define IFX_EVADC_OCS_TGS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_OCS_Bits.TGS */
#define IFX_EVADC_OCS_TGS_OFF (0u)

/** \brief Length for Ifx_EVADC_OCS_Bits.TGB */
#define IFX_EVADC_OCS_TGB_LEN (1u)

/** \brief Mask for Ifx_EVADC_OCS_Bits.TGB */
#define IFX_EVADC_OCS_TGB_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_OCS_Bits.TGB */
#define IFX_EVADC_OCS_TGB_OFF (2u)

/** \brief Length for Ifx_EVADC_OCS_Bits.TG_P */
#define IFX_EVADC_OCS_TG_P_LEN (1u)

/** \brief Mask for Ifx_EVADC_OCS_Bits.TG_P */
#define IFX_EVADC_OCS_TG_P_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_OCS_Bits.TG_P */
#define IFX_EVADC_OCS_TG_P_OFF (3u)

/** \brief Length for Ifx_EVADC_OCS_Bits.SUS */
#define IFX_EVADC_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_EVADC_OCS_Bits.SUS */
#define IFX_EVADC_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_OCS_Bits.SUS */
#define IFX_EVADC_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_EVADC_OCS_Bits.SUS_P */
#define IFX_EVADC_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_EVADC_OCS_Bits.SUS_P */
#define IFX_EVADC_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_OCS_Bits.SUS_P */
#define IFX_EVADC_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_EVADC_OCS_Bits.SUSSTA */
#define IFX_EVADC_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_EVADC_OCS_Bits.SUSSTA */
#define IFX_EVADC_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_OCS_Bits.SUSSTA */
#define IFX_EVADC_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_EVADC_KRSTCLR_Bits.CLR */
#define IFX_EVADC_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_EVADC_KRSTCLR_Bits.CLR */
#define IFX_EVADC_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_KRSTCLR_Bits.CLR */
#define IFX_EVADC_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_EVADC_KRST1_Bits.RST */
#define IFX_EVADC_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_EVADC_KRST1_Bits.RST */
#define IFX_EVADC_KRST1_RST_MSK (0x1u)

