veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxEvadc_bf.h
/** \brief Length for Ifx_EVADC_G_SEFCLR_Bits.SEV1 */
#define IFX_EVADC_G_SEFCLR_SEV1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SEFCLR_Bits.SEV1 */
#define IFX_EVADC_G_SEFCLR_SEV1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SEFCLR_Bits.SEV1 */
#define IFX_EVADC_G_SEFCLR_SEV1_OFF (1u)

/** \brief Length for Ifx_EVADC_G_SEFCLR_Bits.SEV2 */
#define IFX_EVADC_G_SEFCLR_SEV2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SEFCLR_Bits.SEV2 */
#define IFX_EVADC_G_SEFCLR_SEV2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SEFCLR_Bits.SEV2 */
#define IFX_EVADC_G_SEFCLR_SEV2_OFF (2u)

/** \brief Length for Ifx_EVADC_G_CEVNP0_Bits.CEV0NP */
#define IFX_EVADC_G_CEVNP0_CEV0NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV0NP */
#define IFX_EVADC_G_CEVNP0_CEV0NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV0NP */
#define IFX_EVADC_G_CEVNP0_CEV0NP_OFF (0u)

/** \brief Length for Ifx_EVADC_G_CEVNP0_Bits.CEV1NP */
#define IFX_EVADC_G_CEVNP0_CEV1NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV1NP */
#define IFX_EVADC_G_CEVNP0_CEV1NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV1NP */
#define IFX_EVADC_G_CEVNP0_CEV1NP_OFF (4u)

/** \brief Length for Ifx_EVADC_G_CEVNP0_Bits.CEV2NP */
#define IFX_EVADC_G_CEVNP0_CEV2NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV2NP */
#define IFX_EVADC_G_CEVNP0_CEV2NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV2NP */
#define IFX_EVADC_G_CEVNP0_CEV2NP_OFF (8u)

/** \brief Length for Ifx_EVADC_G_CEVNP0_Bits.CEV3NP */
#define IFX_EVADC_G_CEVNP0_CEV3NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV3NP */
#define IFX_EVADC_G_CEVNP0_CEV3NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV3NP */
#define IFX_EVADC_G_CEVNP0_CEV3NP_OFF (12u)

/** \brief Length for Ifx_EVADC_G_CEVNP0_Bits.CEV4NP */
#define IFX_EVADC_G_CEVNP0_CEV4NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV4NP */
#define IFX_EVADC_G_CEVNP0_CEV4NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV4NP */
#define IFX_EVADC_G_CEVNP0_CEV4NP_OFF (16u)

/** \brief Length for Ifx_EVADC_G_CEVNP0_Bits.CEV5NP */
#define IFX_EVADC_G_CEVNP0_CEV5NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV5NP */
#define IFX_EVADC_G_CEVNP0_CEV5NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV5NP */
#define IFX_EVADC_G_CEVNP0_CEV5NP_OFF (20u)

/** \brief Length for Ifx_EVADC_G_CEVNP0_Bits.CEV6NP */
#define IFX_EVADC_G_CEVNP0_CEV6NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV6NP */
#define IFX_EVADC_G_CEVNP0_CEV6NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV6NP */
#define IFX_EVADC_G_CEVNP0_CEV6NP_OFF (24u)

/** \brief Length for Ifx_EVADC_G_CEVNP0_Bits.CEV7NP */
#define IFX_EVADC_G_CEVNP0_CEV7NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV7NP */
#define IFX_EVADC_G_CEVNP0_CEV7NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV7NP */
#define IFX_EVADC_G_CEVNP0_CEV7NP_OFF (28u)

/** \brief Length for Ifx_EVADC_G_CEVNP1_Bits.CEV8NP */
#define IFX_EVADC_G_CEVNP1_CEV8NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP1_Bits.CEV8NP */
#define IFX_EVADC_G_CEVNP1_CEV8NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP1_Bits.CEV8NP */
#define IFX_EVADC_G_CEVNP1_CEV8NP_OFF (0u)

/** \brief Length for Ifx_EVADC_G_CEVNP1_Bits.CEV9NP */
#define IFX_EVADC_G_CEVNP1_CEV9NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP1_Bits.CEV9NP */
#define IFX_EVADC_G_CEVNP1_CEV9NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP1_Bits.CEV9NP */
#define IFX_EVADC_G_CEVNP1_CEV9NP_OFF (4u)

/** \brief Length for Ifx_EVADC_G_CEVNP1_Bits.CEV10NP */
#define IFX_EVADC_G_CEVNP1_CEV10NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP1_Bits.CEV10NP */
#define IFX_EVADC_G_CEVNP1_CEV10NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP1_Bits.CEV10NP */
#define IFX_EVADC_G_CEVNP1_CEV10NP_OFF (8u)

/** \brief Length for Ifx_EVADC_G_CEVNP1_Bits.CEV11NP */
#define IFX_EVADC_G_CEVNP1_CEV11NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP1_Bits.CEV11NP */
#define IFX_EVADC_G_CEVNP1_CEV11NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP1_Bits.CEV11NP */
#define IFX_EVADC_G_CEVNP1_CEV11NP_OFF (12u)

/** \brief Length for Ifx_EVADC_G_CEVNP1_Bits.CEV12NP */
#define IFX_EVADC_G_CEVNP1_CEV12NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP1_Bits.CEV12NP */
#define IFX_EVADC_G_CEVNP1_CEV12NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP1_Bits.CEV12NP */
#define IFX_EVADC_G_CEVNP1_CEV12NP_OFF (16u)

/** \brief Length for Ifx_EVADC_G_CEVNP1_Bits.CEV13NP */
#define IFX_EVADC_G_CEVNP1_CEV13NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP1_Bits.CEV13NP */
#define IFX_EVADC_G_CEVNP1_CEV13NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP1_Bits.CEV13NP */
#define IFX_EVADC_G_CEVNP1_CEV13NP_OFF (20u)

/** \brief Length for Ifx_EVADC_G_CEVNP1_Bits.CEV14NP */
#define IFX_EVADC_G_CEVNP1_CEV14NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP1_Bits.CEV14NP */
#define IFX_EVADC_G_CEVNP1_CEV14NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP1_Bits.CEV14NP */
#define IFX_EVADC_G_CEVNP1_CEV14NP_OFF (24u)

/** \brief Length for Ifx_EVADC_G_CEVNP1_Bits.CEV15NP */
#define IFX_EVADC_G_CEVNP1_CEV15NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP1_Bits.CEV15NP */
#define IFX_EVADC_G_CEVNP1_CEV15NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP1_Bits.CEV15NP */
#define IFX_EVADC_G_CEVNP1_CEV15NP_OFF (28u)

/** \brief Length for Ifx_EVADC_G_REVNP0_Bits.REV0NP */
#define IFX_EVADC_G_REVNP0_REV0NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP0_Bits.REV0NP */
#define IFX_EVADC_G_REVNP0_REV0NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP0_Bits.REV0NP */
#define IFX_EVADC_G_REVNP0_REV0NP_OFF (0u)

/** \brief Length for Ifx_EVADC_G_REVNP0_Bits.REV1NP */
#define IFX_EVADC_G_REVNP0_REV1NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP0_Bits.REV1NP */
#define IFX_EVADC_G_REVNP0_REV1NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP0_Bits.REV1NP */
#define IFX_EVADC_G_REVNP0_REV1NP_OFF (4u)

/** \brief Length for Ifx_EVADC_G_REVNP0_Bits.REV2NP */
#define IFX_EVADC_G_REVNP0_REV2NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP0_Bits.REV2NP */
#define IFX_EVADC_G_REVNP0_REV2NP_MSK (0xfu)

